Revit 2026 API

# ParameterUtilsIsBuiltInParameter(ForgeTypeId) Method

---

Checks whether a ForgeTypeId identifies a built-in parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsBuiltInParameter(
	ForgeTypeId parameterTypeId
)
```
```vb
Public Shared Function IsBuiltInParameter (
	parameterTypeId As ForgeTypeId
) As Boolean
```
```cpp
public:
static bool IsBuiltInParameter(
	ForgeTypeId^ parameterTypeId
)
```
```fsharp
static member IsBuiltInParameter :
        parameterTypeId : ForgeTypeId -> bool
```

#### Parameters

parameterTypeId ForgeTypeId
     The identifier to check.

#### Return Value

Boolean True if the ForgeTypeId identifies a built-in parameter, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A ForgeTypeId identifies a built-in parameter if it corresponds to a valid BuiltInParameter value.

#### Reference

ParameterUtils Class

IsBuiltInParameter Overload

Autodesk.Revit.DB Namespace